In [1]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'nclass' : ['A', 'B', np.nan, 'B', 'A'],
                   'score' : [5, 4, 3, 4, np.nan]})
df

  nclass  score
0      A    5.0
1      B    4.0
2    NaN    3.0
3      B    4.0
4      A    NaN

In [2]:
df['score'] + 1

0    6.0
1    5.0
2    4.0
3    5.0
4    NaN
Name: score, dtype: float64

In [3]:
pd.isna(df)

   nclass  score
0   False  False
1   False  False
2    True  False
3   False  False
4   False   True

In [4]:
pd.isna(df).sum()

nclass    1
score     1
dtype: int64

In [5]:
df.dropna(subset= ['score'])

  nclass  score
0      A    5.0
1      B    4.0
2    NaN    3.0
3      B    4.0

In [6]:
df_nomis = df.dropna(subset= ['score'])
df_nomis['score'] + 1

0    6.0
1    5.0
2    4.0
3    5.0
Name: score, dtype: float64

In [7]:
df_nomis = df.dropna(subset= ['score', 'nclass'])
df_nomis

  nclass  score
0      A    5.0
1      B    4.0
3      B    4.0

In [8]:
exam = pd.read_csv('exam.csv')
exam.loc[[2,7,14], ['front']] = np.nan
exam

    id  nclass  front  back  design
0    1       1   50.0    98      50
1    2       1   60.0    97      60
2    3       1    NaN    86      78
3    4       1   30.0    98      58
4    5       2   25.0    80      65
5    6       2   50.0    89      98
6    7       2   80.0    90      45
7    8       2    NaN    78      25
8    9       3   20.0    98      15
9   10       3   50.0    98      45
10  11       3   65.0    65      65
11  12       3   45.0    85      32
12  13       4   46.0    98      65
13  14       4   48.0    87      12
14  15       4    NaN    56      78
15  16       4   58.0    98      65
16  17       5   65.0    68      98
17  18       5   80.0    78      90
18  19       5   89.0    68      87
19  20       5   78.0    83      58

In [9]:
exam['front'].mean()

np.float64(55.23529411764706)

In [10]:
exam['front'] = exam['front'].fillna(55)
exam

    id  nclass  front  back  design
0    1       1   50.0    98      50
1    2       1   60.0    97      60
2    3       1   55.0    86      78
3    4       1   30.0    98      58
4    5       2   25.0    80      65
5    6       2   50.0    89      98
6    7       2   80.0    90      45
7    8       2   55.0    78      25
8    9       3   20.0    98      15
9   10       3   50.0    98      45
10  11       3   65.0    65      65
11  12       3   45.0    85      32
12  13       4   46.0    98      65
13  14       4   48.0    87      12
14  15       4   55.0    56      78
15  16       4   58.0    98      65
16  17       5   65.0    68      98
17  18       5   80.0    78      90
18  19       5   89.0    68      87
19  20       5   78.0    83      58

In [11]:
exam['front'].isna().sum()

np.int64(0)